{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "return_state": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "go_backwards": false, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "use_bias": true, "name": "lstm_1", "unroll": false, "activity_regularizer": null, "implementation": 1, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dropout": 0.0, "activation": "tanh", "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": false, "units": 20, "batch_input_shape": [null, 30, 5]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}